In [ ]:
##### By Kelvin Enos-Dzah
# importing pandas
import pandas as pd

sheet_name = 'Dataset salary 2024'
dataset = pd.read_excel('Dataset salary 2024.xlsx', sheet_name)

dataset.tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
16529,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
16530,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
16531,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
16532,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
16533,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [4]:

dataset['salary_category'] = dataset['salary_in_usd'].apply(lambda x: 'Low' if x < 100000 else 'High')

# Display the updated DataFrame with the new column
print(dataset[['job_title', 'salary_in_usd', 'salary_category']].tail())

                      job_title  salary_in_usd salary_category
16529            Data Scientist         412000            High
16530  Principal Data Scientist         151000            High
16531            Data Scientist         105000            High
16532     Business Data Analyst         100000            High
16533      Data Science Manager          94665             Low

In [13]:
# Export the updated DataFrame to an Excel file
dataset.to_excel('Updated_Dataset_Salary_2024.xlsx', index=False)

In [6]:
# Replace abbreviations in the 'employment_type' column with their full meanings
employment_type_mapping = {
    'FT': 'Full-Time',
    'PT': 'Part-Time',
    'CT': 'Contract',
    'FL': 'Freelance'
}

# Apply the mapping
dataset['employment_type'] = dataset['employment_type'].replace(employment_type_mapping)

print(dataset['employment_type'].tail())
# dataset.head()

# Save the updated DataFrame (if needed)
# dataset.to_excel('Dataset_Salary_2024_q2.xlsx', index=False)

16529    Full-Time
16530    Full-Time
16531    Full-Time
16532     Contract
16533    Full-Time
Name: employment_type, dtype: object

In [17]:
# Calculate the total salary earned by all respondents
total_salary_all_respondents = dataset['salary_in_usd'].sum()
print(f"Total salary earned by all respondents: {total_salary_all_respondents}")

Total salary earned by all respondents: 2474921187

In [18]:
# Calculate the total salary for Data Scientists
total_salary_data_scientists = dataset[dataset['job_title'] == 'Data Scientist']['salary_in_usd'].sum()
print(f"Total salary earned by Data Scientists: {total_salary_data_scientists}")

Total salary earned by Data Scientists: 510799545

In [19]:
# Calculate total salary for Data Analysts with Full-Time employment
total_salary_data_analysts_ft = dataset[(dataset['job_title'] == 'Data Analyst') & (dataset['experience_level'] == 'EN')]['salary_in_usd'].sum()
print(f"Total salary earned by Full-Time Data Analysts: {total_salary_data_analysts_ft}")

Total salary earned by Full-Time Data Analysts: 262896068

In [21]:
total_salary_data_analysts = dataset[(dataset['job_title'] == 'Data Analyst') &(dataset['employment_type'] == 'EN')]['salary_in_usd'].sum()
print(f"Total salary experience_level en earned by Data Analysts: {total_salary_data_analysts}")

Total salary experience_level en earned by Data Analysts: 0